import { Column } from 'react-table';

import { DocumentModel } from '@reglament';

export const data: DocumentModel[] = [
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
  {
    id: 5458,
    type: 'Постановление',
    name:
      'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
    agency: 'АГО',
    number: '490-па',
    placed_at: '15.10.2020',
    created_at: '15.10.2020',
  },
];

export const columns: Column<DocumentModel>[] = [
  {
    Header: '№',
    accessor: 'id',
  },
  {
    Header: 'Вид документа',
    accessor: 'type',
  },
  {
    Header: 'Орган',
    accessor: 'agency',
  },
  {
    Header: 'Дата документа',
    accessor: 'placed_at',
  },
  {
    Header: 'Номер документа',
    accessor: 'number',
  },
  {
    Header: 'Наименование',
    accessor: 'name',
  },
  {
    Header: 'Дата размещения',
    accessor: 'created_at',
  },
];
