import { SearchDraft, DocumentModel } from '@reglament';

import { sleep } from '../utils/functions';

export const mockSearch = async (
  _: SearchDraft,
): Promise<DocumentModel[]> => {
  await sleep(1000);

  return [
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
    {
      id: 5458,
      type: 'Постановление',
      name:
        'О мерах по укреплению пожарной безопасности на осенне-зимний период 2020-2021 годов ',
      agency: 'АГО',
      number: '490-па',
      placed_at: '15.10.2020',
      created_at: '15.10.2020',
    },
  ];
};
